cask_args appdir: '/Applications'

tap "homebrew/dupes"
tap "homebrew/apache"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "pivotal/tap"
tap "caskroom/fonts"
tap "caskroom/cask"


brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'zsh'
brew 'zsh-completions'
brew 'antigen'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'thefuck'
brew 'tree'
brew 'gettext'
brew 'pstree'
brew 'watch'
brew 'jpeg'
brew 'readline'
brew 'autossh'
brew 'wget'
brew 'dnsmasq'
brew 'macvim'
brew 'jp2a'
brew 'jq'
brew 'openssl'
brew 'readline'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'youtube-dl'
brew 'openssl'
brew 'ffmpeg'

brew 'gti'
brew 'git'
brew 'git-flow'
brew 'git-fire'
brew 'gitup'
brew 'hub'

brew 'gource'

brew 'grafana'

brew 'mysql'
brew 'sqlite'

brew 'go'

brew 'groovysdk'

brew 'python'
brew 'python3'

brew 'ant'
brew 'maven'
brew 'gradle'

brew 'php56'
brew 'imagemagick'
brew 'php56-mcrypt'
brew 'composer'

brew 'springboot'

brew 'node'
brew 'yarn'
brew 'nvm'

brew 'ruby'
brew 'rvm'

cask '1password'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'steam'
cask 'vlc'
cask 'docker'
cask 'dropbox'
cask 'iterm2'
cask 'intellij-idea'
cask 'phpstorm'
cask 'goland'
cask 'sequel-pro'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'spotify'
cask 'omnifocus'
cask 'typora'
cask 'hipchat'
cask 'postman'
cask 'insomnia'
cask 'xmind'
cask 'seashore'
cask 'tunnelbear'
cask 'font-hack-nerd-font'
cask 'alfred'
