cask_args appdir: '/Applications'

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "pivotal/tap"
tap "jesseduffield/lazygit"
tap "caskroom/fonts"
tap "caskroom/cask"
tap "caskroom/versions"
tap "timothyye/tap"
tap "go-task/tap/"
tap "skanehira/docui"
tap "cjbassi/gotop"
tap "wagoodman/dive"
tap "derailed/k9s"
tap "isacikgoz/taps"

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'zsh'
brew 'zsh-completions'
brew 'antigen'
#brew 'bash-completion'
#brew 'bash-git-prompt'
brew 'thefuck'
brew 'tree'
brew 'gettext'
brew 'pstree'
brew 'watch'
brew 'jpeg'
brew 'readline'
brew 'autossh'
brew 'wget'
brew 'httpie'
#brew 'dnsmasq'
brew 'macvim'
brew 'jp2a'
brew 'jq'
brew 'openssl'
brew 'readline'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'youtube-dl'
brew 'openssl'
brew 'ffmpeg'
brew 'bat'
brew 'lsd'

brew 'gti'
brew 'git'
#brew 'git-flow'
brew 'gitup'
brew 'git-quick-stats'
brew 'lazygit'
brew 'hub'
brew 'interactive-rebase-tool'
brew 'gitin'

brew 'gource'

brew 'grafana'

brew 'mysql'
brew 'sqlite'

brew 'go'

brew 'groovysdk'

brew 'python'
brew 'python3'

brew 'ant'
brew 'maven'
brew 'gradle'

#brew 'php56'
#brew 'imagemagick'
#brew 'composer'

brew 'springboot'

brew 'node'
brew 'yarn'
brew 'nvm'

brew 'ruby'

brew 'ctop'
brew 'autojump'
brew 'warp'
brew 'timothyye/tap/skm'
brew 'wrk'
brew 'gitleaks'
brew 'go-task/tap/go-task'
brew 'hh'
brew 'mkcert'
brew 'nss'
brew 'skanehira/docui'
brew 'gotop'
brew 'fx'
brew 'dive'
brew 'kubernetes-helm'
brew 'k9s'
brew 'kubectx'
brew 'kustomize'
brew 'terraform'
brew 'terraformer'

# CASK APPLICATIONS

cask 'java'
cask 'java8'
cask 'java9'
cask '1password'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'steam'
cask 'vlc'
cask 'docker'
cask 'dropbox'
cask 'iterm2'
cask 'intellij-idea'
#cask 'phpstorm'
cask 'goland'
cask 'sequel-pro'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'spotify'
cask 'omnifocus'
cask 'typora'
#cask 'hipchat'
#cask 'postman'
cask 'insomnia'
cask 'xmind'
cask 'tunnelbear'
cask 'font-hack-nerd-font'
cask 'alfred'
cask 'bettertouchtool'
cask 'discord'
cask 'google-cloud-sdk'
cask 'minikube'
#cask 'EnergyBar'
cask 'fork'
cask 'gitup'
cask 'gitahead'
